<template>
	<view id="foodSafety">
		<view class="tit">
			食品安全责任承诺书
		</view>
		<view class="Con">
			根据《中华人民共和国食品安全法》和政府相关部门关于食品安全监督管理文件的精神，要求全面做到责任落实到个人、防患于未然，特结合新发地市场实际情况，作出以下承诺：
		</view>
		<view class="Con">
			一、承诺严格依照《食品安全法》、《中华人民共和国食品安全法实施条例》等法律法规从事食品经营活动，对社会和公众负责，诚信经营，保证食品安全，接受社会监督，承担社会责任。场馆负责人、餐饮企业负责人、营业执照法定代表人、个体执照负责人为第一责任人。
		</view>
		<view class="Con">
			二、承诺遵守新发地市场制定的各项管理制度，不得损害市场利益，以及其他经营者和消费者的合法权益，严禁销售有毒、有害食品。所有经营商户须依法登记注册，取得营业执照、专项审批手续以及相应的上岗证明、资质证明。亮照经营，禁止无照经营和出租转让营业执照。
		</view>
		<view class="Con">
			三、承诺按市场规定建立严格的食品进货查验、记录制度。采购食品时做到严谨查验供货者的许可证和食品合格证等相关证明文件，并如实记录食品的名称、规格、数量、生产批号、保质期、供货者名称及联系方式、进货日期等内容。经营者须保证食品进货查验记录真实，保存期限不少于二年。承诺在条件成熟时尽量使用电子方式记录台帐。
		</view>
		<view class="Con">
			四、承诺按市场规定严格执行从业人员健康管理制度。从业人员须每年进行健康检查，取得健康证明后方可从事食品经营活动。承诺经营人员须保持个人卫生，销售食品时洗净双手，穿戴整洁、干净的工作衣、帽。
		</view>
		<view class="Con">
			五、承诺日常工作中市场规定的配备专职或者兼职的食品安全管理人员，制定保证食品安全的规章制度。承诺遵守被吊销食品生产、流通或者餐馆服务许可证的单位，其直接负责的主管人员自处罚决定之日起五年内不得从事食品经营管理工作的管理规定。
		</view>
		<view class="Con">
			六、承诺按市场规定完善与经营的食品品种、数量相适应的消毒、更衣、盥洗、采光、照明、通风、防腐、防尘、防蝇、防鼠、防虫、洗涤以及处理废水、存放垃圾和废弃物的各项设备及设施。
		</view>
		<view class="Con">
			七、承诺按市场的规定严格按照保证食品安全的要求贮存食品，经营者及管理者定期检查货架及库存食品，及时清理变质或者超过保质期的食品。
		</view>
		<view class="Con">
			八、承诺对于自检或行政部门公布的不合格食品，会立即采取下架封存、停止销售等措施，保证通知相关生产经营者和消费者，记录停止经营和通知情况，并协助做好不合格食品的召回工作。
		</view>
		<view class="Con">
			九、经营预包装食品的，承诺做到下列要求：
		</view>
		<view class="ConSun">
			（一）按照食品标签标示的警示标志、警示说明或者注意事项的要求销售；
		</view>
		<view class="ConSun">
			（二）进口预包装食品的包装上有中文标签、中文说明书，并载明食品原产地以及境内代理商的名称、地址、联系方式。
		</view>
		<view class="Con">
			十、经营散装食品的，应做到下列要求：
		</view>
		<view class="ConSun">
			（一）贮存散装食品，在贮存位置标明食品的名称、生产日期、保质期、生产名称及联系方式等内容，并做到卫生、安全贮存；
		</view>
		<view class="ConSun">
			（二）销售散装食品，在散装食品的容器、外包装上标明食品的名称、生产日期、保质期、生产经营者名称及联系方式等内容；
		</view>
		<view class="Con">
			十一、经营直接入口食品的，承诺做到下列要求：
		</view>
		<view class="ConSun">
			（一）严厉禁止患有痢疾、伤寒、病毒性肝炎等消化道传染性疾病的人员，以及患有活动性肺结核、化脓性或者渗出性皮肤病等有碍食品安全的疾病的人员，从事经营活动；
		</view>
		<view class="ConSun">
			（二）备有小包装或者使用无毒、清洁的包装材料、餐具；
		</view>
		<view class="ConSun">
			（三）使用无毒、清洁的售货、操作工具；
		</view>
		<view class="ConSun">
			（四）用水须符合国家规定的生活饮用水卫生标准；
		</view>
		<view class="ConSun">
			（五）所使用的洗涤剂、消毒剂对人体安全、无害；
		</view>
		<view class="Con">
			十二、经营食品贮存、运输和装卸业务的，承诺做到下列要求：
		</view>
		<view class="ConSun">
			（一）保证贮存、运输和装卸食品的容器、工具和设备安全、无害，并保持清洁；
		</view>
		<view class="ConSun">
			（二）不将食品与有毒、有害物质、物品一同贮存、运输和装卸。
		</view>
		<view class="Con">
			十三、经营食品批发业务的，承诺做到下列要求：
		</view>
		<view class="ConSun">
			（一）出具有溯源功能的销售凭证，如实记录食品的名称、规格、数量、生产批号、保质期、购货者名称及联系方式、销售日期等内容，其中一联用于建立销售台帐；
		</view>
		<view class="ConSun">
			（二）在条件允许情况下，设置食品检测室，配备专门的检测设备，有专职的检测人员，每天开展食品检测工作，并将检测结果在醒目位置公示。
		</view>
		<view class="Con">
			十四、承诺如果销售了不符合食品安全标准的食品，造成消费者产生了不良后果，赔偿消费者损失，并支付相应的赔偿金。同时构成对新发地市场的根本性违约，新发地市场有权立即解除租赁协议收回租赁标的，已交纳的租金和保证金、招标费不予退还，作为违约金赔偿给新发地市场。
		</view>
		<view class="Con">
			十五、承诺食品广告的内容要求真实合法，不含有虚假、夸大的内容，不涉及疾病预防、治疗功能。
		</view>
		<view class="Con">
			十六、承诺自觉接受群众监督，定期参加自律组织的活动。
		</view>
		<view class="Con">
			十七、承诺同意违反上述规定后承担以下责任追究：
		</view>
		<view class="ConSun">
			（一）本责任书以《中华人民共和国食品安全法》、《餐饮业食品卫生管理办法》为执行细则，对违反其中任何一条所造成的食品安全事故，将追究其单位责任人和岗位负责人的责任，视责任轻重处以200元到10000元的罚款，情节恶劣影响极大的交由公安部门处理。
		</view>
		<view class="ConSun">
			（二）违反规定者，经限期整治，5日内达不到质量安全和卫生标准的，由市相关部门给予通报批评或依法处理，并依法追究有关人员的责任。
		</view>
		<view class="Con">
			十八、承诺因经营者个人行为、原因，违反此管理规定发生的一切纠纷由该经营者自行承担一切后果及法律责任。
		</view>
		<view class="Con">
			十九、承诺已仔细阅读并知悉本食品安全责任承诺书的所有内容，并保证严格遵守承诺。
		</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {

			};
		}
	}
</script>

<style lang="scss">
	#foodSafety {
		background-color: #fff;
		padding: 30rpx 40rpx 100rpx 40rpx;
		.tit {
			text-align: center;
			font-size: 36rpx;
			font-weight: 600;
			margin-bottom: 30rpx;
		}
		.Con {
			text-indent: 50rpx;
		}
		.ConSun {
			text-indent: 80rpx;
		}
	}
</style>
