<template>
	<view id="foodquality">
		<view class="tit">
			新发地市场农产品质量安全保证书
		</view>
		<view class="Con">
			一、本人保证严格执行国家有关法律法规，遵守市场管理制度，自觉维护市场秩序。
		</view>
		<view class="Con">
			二、本人保证不销售《食用农产品市场销售质量安全监督管理办法》第二十五条规定的禁止销售的食用农产品，并对所销售的食用农产品质量安全承担法律责任和赔偿责任。 
		</view>
		<view class="Con">
			三、本人保证要向市场主动提供公司名称或经营者姓名、社会信用代码或者身份证号码、联系方式、住所、食用农产品主要品种、进货渠道、产地等信息。
		</view>
		<view class="Con">
			四、本人保证采购食用农产品，应查验供货方合法有效的食用农产品产地证明或者购货凭证、合格证明文件，留存相关凭证，并向市场提交相关证明资料。
		</view>
		<view class="Con">
			五、本人同意市场对我公司或个人查验并留存我方的社会信用代码或者身份证复印件，食用农产品产地证明或者购货凭证、合格证明文件。本人保证如果无法提供食用农产品产地证明或者购货凭证、合格证明文件的，同意市场进行抽样检验或者快速检测;抽样检验或者快速检测合格的，方可进入市场销售。 
		</view>
		<view class="Con">
			六、本人保证必须建立食用农产品进货查验记录(或委托甲方建立)，以备查验。
		</view>
		<view class="Con">
			七、本人保证同意市场协助监管部门不定期对我公司或个人的食用农产品进货查验记录进行查验;我公司或个人保证记录和凭证真实，保存期限不得少于6个月。
		</view>
		<view class="Con">
			八、本人保证同意市场对我公司或个人的销售环境和条件以及食用农产品质量安全状况进行检查。市场发现我公司或我个人存在食用农产品不符合食品安全标准等违法行为的，我保证同意市场的任何处理办法。 
		</view>
		<view class="Con">
			九、本人保证建立并执行食用农产品质量安全自查制度，定期对食用农产品质量安全情况进行检查，发现不符合食用农产品质量安全要求的，立即停止销售并采取整改措施;有发生食品安全事故潜在风险的，立即停止销售并向所在地县级食品药品监督管理部门报告。
		</view>
		<view class="Con">
			十、本人保证发现销售的食用农产品不符合食品安全标准或者有证据证明可能危害人体健康的，应当立即停止销售，通知相关生产经营者、消费者，并记录停止销售和通知情况。认为应当召回的，应当立即召回。
		</view>
		<view class="Con">
			十一、本人保证对被抽样检验或快速检测不合格的食用农产品，立即停止销售。对抽样检验或快速检测结果无异议的，或者复检结果确定不合格的，应按照要求处理。
		</view>
		<view class="Con">
			十二、本人保证应配合市场，对停止销售的食用农产品采取无害化处理、销毁等措施，防止其再次流入市场。
		</view>
		<view class="Con">
			十三、本人保证将停止销售、召回和处理情况向所在地县级食品药品监督管理部门报告，配合政府有关部门根据有关法律法规进行处理，并记录相关情况。
		</view>
		<view class="Con">
			十四、本人保证对因标签、标志或者说明书不符合食品安全标准而被召回的食用农产品，在采取补救措施且能保证食用农产品质量安全的情况下可以继续销售，销售时应向消费者明示补救措施。
		</view>
		<view class="Con">
			十五、本人保证贮存食用农产品，应当如实记录食用农产品名称、产地、贮存日期、生产者或者供货者名称或者姓名、联系方式等内容，并在贮存场所保存记录。记录和凭证保存期限不得少于6个月。
		</view>
		<view class="Con">
			十六、本人保证销售按规定应当包装或附加标签的食用农产品，在包装或者附加标签后方可销售。对散装销售的食用农产品，按照市场的要求，使用市场统一制作场内固定摊位公示标牌，内容包括:产品名称、产地、生产者或者销售者名称等信息。
		</view>
		<view class="Con">
			十七、本人保证销售进口食用农产品，以及分装销售进口食用农产品，包装标签应当按规定标注有关信息。
		</view>
		<view class="Con">
			十八、本人保证已认真仔细阅读了本新发地市场农产品质量安全保证书，并已全面知悉本保证书的内容，并保证严格遵守。
		</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				
			};
		}
	}
</script>

<style lang="scss">
#foodquality {
	background-color: #fff;
	padding: 30rpx 40rpx 100rpx 40rpx;
	.tit {
		text-align: center;
		font-size: 36rpx;
		font-weight: 600;
		margin-bottom: 30rpx;
	}
	.Con {
		text-indent: 50rpx;
	}
	.ConSun {
		text-indent: 80rpx;
	}
}
</style>
