/* 验证方法 */
export default {
  COUPON_7: /(^[0-9]{3,4}-[0-9]{3,8}$)|(^[0-9]{3,8}$)|(^\([0-9]{3,4}\)[0-9]{3,8}$)|(^0{0,1}1[3|4|5|6|7|8|9][0-9]{9}$)/, /* 必须为数字,且大于8位到13位 */
  MOBILE_REGEXP: /^1[3|4|5|6|7|8|9][0-9]\d{8,8}$/, // 手机正则校验
  MOBILE_LENGTH:/^1\d{10}$/, // 1开头，11位数字，正则校验
  MOBILE_PASSWORD: /^[0-9A-Za-z]{6,}$/,
  CHARACTER_NUM_04: /(^.{1,4}$)/, /* 不能超过4个字 */
  CHARACTER_NUM_6: /^[A-Za-z0-9\u4e00-\u9fa5]+$/, /* 只能输入6个字 */
  CHARACTER_NUM_06: /(^.{1,6}$)|(^[0-9A-Za-z ]{1,12}$)/, /* 不能超过6个字 */
  CHARACTER_NUM_10: /(^.{1,10}$)|(^[0-9A-Za-z ]{1,20}$)/, /* 不能超过10个字 */
  CHARACTER_NUM_20: /(^.{1,20}$)|(^[0-9A-Za-z ]{1,40}$)/, /* 不能超过20个字 */
  CHARACTER_NUM_15: /^[a-zA-Z0-9]{15,15}$/, /* 不能超过15个字 */
  CHARACTER_NUM_18: /^[a-zA-Z0-9]{18,18}$/, /* 不能超过18个字 */
  // CHARACTER_NUM_10: /(^[\u4e00-\u9fa5 ]{1,10}$)|(^[0-9A-Za-z ]{1,20}$)/, /* 不能超过10个字 */
  COUPON: /^([0-9][0-9]{0,60})$/, /* 必须为数字 */
  COUPON_0: /^([1-9][0-9]{0,6})$/, /* 必须为大于0数字 */
  COUPON_6: /^([0-9][0-9]{5,18})$/, /* 必须为数字,且大于6位 */
  COUPON_4: /^([0-9][0-9]{3})$/, /* 必须为数字,且只能4位 */
  DECIMALS_2: /^(0|[1-9]\d{0,9}|0\.\d{1,2}|[1-9]\d{0,10}\.\d{1,2})$/, /* 两位小数 */
  DECIMALS_3: /^(0|[1-9]\d{0,9}|0\.\d{1,3}|[1-9]\d{0,10}\.\d{1,3})$/, /* 三位小数 */
  EMAIL: /^[a-z0-9!#$%&'*+/=?^_`{|}~.-]+@[a-z0-9]([a-z0-9-]*[a-z0-9])?(\.[a-z0-9]([a-z0-9-]*[a-z0-9])?)*$/i, /* 邮箱验证 */
  ID_CODE: /(^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$)|(^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])((\d{4})|\d{3}[Xx])$)/i, /* 身份证号码 */
  INTEGER1_100: /^[0-9]\d{0,1}$/, /* 1-100之间的整数 */
  INTEGER1_100_2: /^(0|[1-9]\d{0,1}|0\.\d{1,2}|[1-9]\d{0,1}\.\d{1,2})$/, /* 1-100之间的整数且保留两位小数 */
  NEW_INTEGER1_100_2:/^(([1-9][0-9]*)|(([0]\.\d{1,2}|[1-9][0-9]*\.\d{1,2})))$/,/*无限制整数，小数点后保留两位*/
  COMMON: /^\S[a-zA-Z\s\d\u4e00-\u9fa5]+\S$/,
  COMBINATION: /^(?:(?=.*[A-Z])(?=.*[a-z])(?=.*[0-9])(?=.*[^A-Za-z0-9])).{10,30}$/ ,// 10位密码 大写,小写,数字,符号组合的密码
  ID_CARD:/^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$|^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}([0-9]|X)$/, // 身份证
  CREDIT_CODE: /^[^_IOZSVa-z\W]{2}\d{6}[^_IOZSVa-z\W]{10}$/g, // 社会统一信用代码
  USER_NAME: /^[\u4e00-\u9fa5_a-zA-Z0-9_]{2,8}$/, // 汉字/大小写字母/阿拉伯数字（不能包含特殊符号），长度2-8个字符
  USER_NAME_MAX: /^[a-zA-Z0-9]{4,20}$/, // 汉字/大小写字母/阿拉伯数字（不能包含特殊符号），长度4-20个字符
  PASS_WORD:/^[a-zA-Z0-9]{6,16}$/, // 大小写字母/阿拉伯数字，长度6-16个字符 密码
  CHEACK_MONEY:/^\+?[1-9][0-9]*$/ ,// 校验正整数
  BUSINESS_LICENSE_CODE:/^([159Y]{1})([1239]{1})([0-9]{6})([0-9ABCDEFGHJKLMNPQRTUWXY]{9})([0-9ABCDEFGHJKLMNPQRTUWXY]{1})$/,/*营业执照号*/
  LENGTH_15:/^[A-Za-z0-9]{15}/,//英文 or 数字 长度15位
  LENGTH_18:/^[A-Za-z0-9]{18}/,//英文 or 数字 长度18位
  CONTAINS_SOME_SPECIAL_CHARACTERS:/^([\u4E00-\u9FA5|0-9a-zA-Z|（）(). /-])+$/,//包含（）. /-字符
  LOGIN_PWD:/(?=.*([a-zA-Z].*))(?=.*[0-9].*)[a-zA-Z0-9-*/+.~!@#$%^&*()]{6,16}$/,//密码正则 6-16位 必须包含数字及字母，可以有特殊字符
  GOODS_NAME:/^([\u4E00-\u9FA5|0-9a-zA-Z|（）()【】[]{}<>《》,*&%$￥#@！~])+$/,//包含（）. /-字符
  NEGATIVE_NUMBER:/^(\-|\+)?\d+(\.\d+)?$/,
  CHINESE_NAME:/^[\u4E00-\u9FA5]{1,16}$/,//只允许汉字 1-16位
};
